modules/groups/models/Group.php

SELECT `title`, `id` FROM `groups`
---
    public function getGroupForDropDown($withDefault = false)
    {
        $items = Group::find()->select(['title', 'id'])->indexBy('id')->column();