modules/students/controllers/AdminStudentController.php

SELECT `title`, `id` FROM `groups`
---
    public function actionCreate()
    {
        $model = new Student();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
            return $this->redirect(['view', 'id' => $model->id]);
        } else {
            return $this->render('create', [
                'model' => $model,
                'groups' => Group::find()->select(['title', 'id'])->indexBy('id')->column(),